gengyuchao/esp32-Twatch/sdkconfig.defaults
#
# Output voltage
#
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_0V7 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_0V8 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_0V9 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_1V0 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_1V1 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_1V2 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_1V3 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_1V4 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_1V5 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_1V6 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_1V7 is not set
CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_1V8=y
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_1V9 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_2V0 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_2V1 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_2V2 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_2V3 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_2V4 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_2V5 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_2V6 is not set
# CONFIG_AXP202_DCDC2_VOLTAGE_BIT50_2V7 is not set
CONFIG_AXP202_DCDC2_VOLTAGE_BIT50=0x2c
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_0V7 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_0V8 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_0V9 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_1V0 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_1V1 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_1V2 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_1V3 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_1V4 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_1V5 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_1V6 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_1V7 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_1V8 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_1V9 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_2V0 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_2V1 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_2V2 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_2V3 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_2V4 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_2V5 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_2V6 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_2V7 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_2V8 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_2V9 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_3V0 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_3V1 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_3V2 is not set
CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_3V3=y
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_3V4 is not set
# CONFIG_AXP202_DCDC3_VOLTAGE_BIT60_3V5 is not set
CONFIG_AXP202_DCDC3_VOLTAGE_BIT60=0x68
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_1V8 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_1V9 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_2V0 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_2V1 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_2V2 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_2V3 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_2V4 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_2V5 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_2V6 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_2V7 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_2V8 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_2V9 is not set
CONFIG_AXP202_LDO24_VOLTAGE_BIT74_3V0=y
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_3V1 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_3V2 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT74_3V3 is not set
CONFIG_AXP202_LDO24_VOLTAGE_BIT74=0xc0
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_1V25 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_1V3 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_1V4 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_1V5 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_1V6 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_1V7 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_1V8 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_1V9 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_2V0 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_2V5 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_2V7 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_2V8 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_3V0 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_3V1 is not set
# CONFIG_AXP202_LDO24_VOLTAGE_BIT30_3V2 is not set
CONFIG_AXP202_LDO24_VOLTAGE_BIT30_3V3=y
CONFIG_AXP202_LDO24_VOLTAGE_BIT30=0x10
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_0V7 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_0V8 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_0V9 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_1V0 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_1V1 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_1V2 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_1V3 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_1V4 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_1V5 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_1V6 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_1V7 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_1V8 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_1V9 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_2V0 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_2V1 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_2V2 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_2V3 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_2V4 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_2V5 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_2V6 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_2V7 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_2V8 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_2V9 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_3V0 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_3V1 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_3V2 is not set
CONFIG_AXP202_LDO3_VOLTAGE_BIT60_3V3=y
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_3V4 is not set
# CONFIG_AXP202_LDO3_VOLTAGE_BIT60_3V5 is not set
CONFIG_AXP202_LDO3_VOLTAGE_BIT60=0x68
# end of Output voltage

#
# ADC control
#
CONFIG_AXP202_ADC_ENABLE_1_BIT7_SELECTED=y
CONFIG_AXP202_ADC_ENABLE_1_BIT6_SELECTED=y
CONFIG_AXP202_ADC_ENABLE_1_BIT5_SELECTED=y
CONFIG_AXP202_ADC_ENABLE_1_BIT4_SELECTED=y
CONFIG_AXP202_ADC_ENABLE_1_BIT3_SELECTED=y
CONFIG_AXP202_ADC_ENABLE_1_BIT2_SELECTED=y
CONFIG_AXP202_ADC_ENABLE_1_BIT1_SELECTED=y
CONFIG_AXP202_ADC_ENABLE_1_BIT0_SELECTED=y
CONFIG_AXP202_ADC_ENABLE_2_BIT7_SELECTED=y
CONFIG_AXP202_ADC_ENABLE_2_BIT3_SELECTED=y
CONFIG_AXP202_ADC_ENABLE_2_BIT2_SELECTED=y
# end of ADC control

CONFIG_AXP202_ADC_ENABLE_1_BIT7=0x80
CONFIG_AXP202_ADC_ENABLE_1_BIT6=0x40
CONFIG_AXP202_ADC_ENABLE_1_BIT5=0x20
CONFIG_AXP202_ADC_ENABLE_1_BIT4=0x10
CONFIG_AXP202_ADC_ENABLE_1_BIT3=0x08
CONFIG_AXP202_ADC_ENABLE_1_BIT2=0x04
CONFIG_AXP202_ADC_ENABLE_1_BIT1=0x02
CONFIG_AXP202_ADC_ENABLE_1_BIT0=0x01
CONFIG_AXP202_ADC_ENABLE_2_BIT7=0x80
CONFIG_AXP202_ADC_ENABLE_2_BIT3=0x08
CONFIG_AXP202_ADC_ENABLE_2_BIT2=0x04

#
# Charge control
#
CONFIG_AXP202_CHARGE_CONTROL_1_BIT7_SELECTED=y
CONFIG_AXP202_CHARGE_CONTROL_1_BIT7=0x80
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT65_41_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT65_415_SELECTED is not set
CONFIG_AXP202_CHARGE_CONTROL_1_BIT65_42_SELECTED=y
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT65_436_SELECTED is not set
CONFIG_AXP202_CHARGE_CONTROL_1_BIT65=0x40
CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_300_SELECTED=y
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_400_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_500_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_600_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_700_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_800_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_900_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_1000_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_1100_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_1200_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_1300_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_1400_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_1500_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_1600_SELECTED is not set
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT30_1700_SELECTED is not set
CONFIG_AXP202_CHARGE_CONTROL_1_BIT30=0x00
# CONFIG_AXP202_CHARGE_CONTROL_1_BIT4_10_SELECTED is not set
CONFIG_AXP202_CHARGE_CONTROL_1_BIT4_15_SELECTED=y
CONFIG_AXP202_CHARGE_CONTROL_1_BIT4=0x10
# end of Charge control
# end of Power system configuration (AXP202)

#
# ESP I2C helper
#

#
# Port 0
#
CONFIG_I2C_HELPER_MASTER_0_SDA=21
CONFIG_I2C_HELPER_MASTER_0_SCL=22
CONFIG_I2C_HELPER_MASTER_0_FREQ_HZ=1000000
# end of Port 0

#
# Port 1
#
CONFIG_I2C_HELPER_MASTER_1_SDA=21
CONFIG_I2C_HELPER_MASTER_1_SCL=22
CONFIG_I2C_HELPER_MASTER_1_FREQ_HZ=1000000
# end of Port 1
# end of ESP I2C helper

#
# lv_examples configuration
#
# CONFIG_LV_EX_PRINTF is not set
CONFIG_LV_USE_DEMO_WIDGETS=y
# CONFIG_LV_USE_DEMO_KEYPAD_AND_ENCODER is not set
# CONFIG_LV_USE_DEMO_BENCHMARK is not set
# CONFIG_LV_USE_DEMO_STRESS is not set
# CONFIG_LV_DEMO_WIDGETS_SLIDESHOW is not set
# end of lv_examples configuration

#
# LVGL configuration
#
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
# CONFIG_LV_CONF_MINIMAL is not set
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_HOR_RES_MAX=240
CONFIG_LV_VER_RES_MAX=240
# CONFIG_LV_COLOR_DEPTH_32 is not set
CONFIG_LV_COLOR_DEPTH_16=y
# CONFIG_LV_COLOR_DEPTH_8 is not set
# CONFIG_LV_COLOR_DEPTH_1 is not set
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_ANTIALIAS=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=30
CONFIG_LV_DPI=130
CONFIG_LV_DISP_SMALL_LIMIT=30
CONFIG_LV_DISP_MEDIUM_LIMIT=50
CONFIG_LV_DISP_LARGE_LIMIT=70

#
# Memory manager settings
#
# CONFIG_LV_MEM_CUSTOM is not set
CONFIG_LV_MEM_SIZE_KILOBYTES=32
# CONFIG_LV_MEMCPY_MEMSET_STD is not set
# end of Memory manager settings

#
# Indev device settings
#
CONFIG_LV_INDEV_DEF_READ_PERIOD=30
CONFIG_LV_INDEV_DEF_DRAG_LIMIT=10
CONFIG_LV_INDEV_DEF_DRAG_THROW=10
CONFIG_LV_INDEV_DEF_LONG_PRESS_TIME=400
CONFIG_LV_INDEV_DEF_LONG_PRESS_REP_TIME=100
CONFIG_LV_INDEV_DEF_GESTURE_LIMIT=50
CONFIG_LV_INDEV_DEF_GESTURE_MIN_VELOCITY=3
# end of Indev device settings

#
# Feature usage
#
CONFIG_LV_USE_ANIMATION=y
CONFIG_LV_USE_SHADOW=y
CONFIG_LV_SHADOW_CACHE_SIZE=0
CONFIG_LV_USE_OUTLINE=y
CONFIG_LV_USE_PATTERN=y
CONFIG_LV_USE_VALUE_STR=y
CONFIG_LV_USE_BLEND_MODES=y
CONFIG_LV_USE_OPA_SCALE=y
CONFIG_LV_USE_IMG_TRANSFORM=y
CONFIG_LV_USE_GROUP=y
CONFIG_LV_USE_GPU=y
# CONFIG_LV_USE_GPU_STM32_DMA2D is not set
# CONFIG_LV_USE_GPU_NXP_PXP is not set
# CONFIG_LV_USE_GPU_NXP_VG_LITE is not set
CONFIG_LV_USE_FILESYSTEM=y
# CONFIG_LV_USE_USER_DATA is not set
# CONFIG_LV_USE_PERF_MONITOR is not set
CONFIG_LV_USE_API_EXTENSION_V6=y
CONFIG_LV_USE_API_EXTENSION_V7=y
# end of Feature usage

#
# Image decoder and cache
#
CONFIG_LV_IMG_CF_INDEXED=y
CONFIG_LV_IMG_CF_ALPHA=y
CONFIG_LV_IMG_CACHE_DEF_SIZE=1
# end of Image decoder and cache

#
# Compiler Settings
#
# CONFIG_LV_BIG_ENDIAN_SYSTEM is not set
# end of Compiler Settings

#
# HAL Settings
#
# CONFIG_LV_TICK_CUSTOM is not set
# end of HAL Settings

#
# Log Settings
#
# CONFIG_LV_USE_LOG is not set
# end of Log Settings

#
# Debug Settings
#
# CONFIG_LV_USE_DEBUG is not set
CONFIG_LV_USE_ASSERT_NULL=y
CONFIG_LV_USE_ASSERT_MEM=y
# CONFIG_LV_USE_ASSERT_MEM_INTEGRITY is not set
# CONFIG_LV_USE_ASSERT_STR is not set
# CONFIG_LV_USE_ASSERT_OBJ is not set
# CONFIG_LV_USE_ASSERT_STYLE is not set
# end of Debug Settings

#
# Font usage
#
# CONFIG_LV_FONT_FMT_TXT_LARGE is not set
# CONFIG_LV_USE_FONT_SUBPX is not set

#
# Enable built-in fonts
#
# CONFIG_LV_FONT_MONTSERRAT_8 is not set
# CONFIG_LV_FONT_MONTSERRAT_10 is not set
# CONFIG_LV_FONT_MONTSERRAT_12 is not set
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
# CONFIG_LV_FONT_MONTSERRAT_18 is not set
# CONFIG_LV_FONT_MONTSERRAT_20 is not set
# CONFIG_LV_FONT_MONTSERRAT_22 is not set
# CONFIG_LV_FONT_MONTSERRAT_24 is not set
# CONFIG_LV_FONT_MONTSERRAT_26 is not set
# CONFIG_LV_FONT_MONTSERRAT_28 is not set
# CONFIG_LV_FONT_MONTSERRAT_30 is not set
# CONFIG_LV_FONT_MONTSERRAT_32 is not set
# CONFIG_LV_FONT_MONTSERRAT_34 is not set
# CONFIG_LV_FONT_MONTSERRAT_36 is not set
# CONFIG_LV_FONT_MONTSERRAT_38 is not set
# CONFIG_LV_FONT_MONTSERRAT_40 is not set
# CONFIG_LV_FONT_MONTSERRAT_42 is not set
# CONFIG_LV_FONT_MONTSERRAT_44 is not set
# CONFIG_LV_FONT_MONTSERRAT_46 is not set
# CONFIG_LV_FONT_MONTSERRAT_48 is not set
# CONFIG_LV_FONT_UNSCII_8 is not set
# CONFIG_LV_FONT_UNSCII_16 is not set
# CONFIG_LV_FONT_MONTSERRAT12SUBPX is not set
# CONFIG_LV_FONT_MONTSERRAT28COMPRESSED is not set
# CONFIG_LV_FONT_DEJAVU_16_PERSIAN_HEBREW is not set
# CONFIG_LV_FONT_SIMSUN_16_CJK is not set
# end of Enable built-in fonts

